{
  "main": {
    "name": "Nicolas Johnson",
    "occupation": "Full Satck Developer",
    "description": "Open to work wherever you need me",
    "image": "profilepic.jpg",
    "employer": "0021",
    "jobDescription": "0012",
    "bio": "A Self-taught die-Hard Full Stack developer based in Brazil. Always setting the highest standards for code quality, with a sharp mind, my heart beat in code, i'm always hungry to learn more and ready for action.",
    "contactmessage": "Here is where you should write your message to readers to have them get in contact with you.",
    "email": "nicolas-sousa2011@hotmail.com",
    "phone": "+55 85 98181-2951",
    "address": {
      "street": "Travessa São Pedro",
      "city": "Fortaleza",
      "state": "CE Brasil",
      "zip": "90721-190"
    },
    "website": "https://safe-cliffs-01394.herokuapp.com/",
    "resumedownload": "https://drive.google.com/drive/folders/1v9dekjg5W9huGIXeAJHZ2yS_cZcsM0gK?usp=sharing",
    "social": [
      {
        "name": "twitter",
        "url": "https://twitter.com/Nicolas_Silva16",
        "className": "fa fa-twitter"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/nicolas-johnson-279662210/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/Nicolas-Johnson",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "I love challenges and am always interested in discover and learn new technologies but these are the ones that have really won me over",
    "education": [
      {
        "school": "Trybe",
        "degree": "Full Stack Developer",
        "graduated": "July 2022",
        "description": "Curriculum based on what the job market is looking for in technology professionals. With content blocks divided into Front-End, Back-End and Computer Science. A course that addresses in addition to several hard skills the most important soft skills such as learning to learn, communication, personal knowledge, team collaboration, pro-activity and many more. Without a doubt one of the most interesting journeys I've ever had so far."
      },
      {
        "school": "Paulo VI",
        "degree": "Technical Computers Network",
        "graduated": "March 2015",
        "description": "Technical level course in Computer Networks, with 3 years of duration. where I learned to design, implement, manage and integrate computer networks. I also learned how to create security solutions in these systems that are present all over the world and in all areas. With disciplines that study all environments related to networks: wireless, with cables, defined by software, IPV4 and IPV6. The security, routing and switching of these systems were also covered."
      }

    ],
    "work": [
      {
        "company": "Previous work experiences",
        "title": "Tourism and Hotels as a Receptionist and Team Leader",
        "years": "January 2017 - December 2019",
        "description": "My previous work experiences are somewhat irrelevant on this new journey of mine. However, I would like to highlight the teamwork and team leadership that I have acquired over the years working in the Tourism and Hotels area. Not to mention the good-vibes i bring and my easy going personality that I gained from years of experience working as a receptionist at a 5 star hotel in one of the most beautiful beaches in Brazil called Jericoacoara."
      }
    ],
    "skills": [
      {
        "name": "React Js",
        "description": "From the wide variety of frameworks JavaScript React is without doubt the best in my opinion and is the one I have the most mastery of.",
        "image": "react.jpg"
      },
      {
        "name": "MongoDB",
        "description": "Although I am familiar with relational DB, my greatest experience is with Stack M.E.R.N. using noSQL in DB, hence the choice of MongoDB.",
        "image": "mongo.jpg"
      },
      {
        "name": "Node JS",
        "description": "The choice of NodeJS on my Back-End was not for nothing, as a good JavaScript developer this choice could not be different.",
        "image": "node.jpg"
      },
            {
        "name": "Bootstrap",
        "description": "Bootstrap is in my heart because of the ease of creation it brings me, although I don't like its lack of flexibility, its agility is what wins me over.",
        "image": "bootstrap.jpg"
      },
      {
        "name": "Heroku",
        "description": "I use Heroku as my hosting platform for most of my projects because so far they are all unpaid and their free tier is convenient.",
        "image": "heroku.jpg"
      },
      {
        "name": "Redux",
        "description": "When it comes to state management Redux is the most used tool in several frameworks so I could not leave Redux out of my toolbox.",
        "image": "redux.jpg"
      }, 
      {
        "name": "Git",
        "description": "When it comes to versioning and collaborative working, Git could not be left out along with my favorite social media ... GitHub.",
        "image": "git.jpg"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "My Landing Page",
        "category": "My personal Landing page Here i put my resume, some of my projects and my favorite technologies. ",
        "image": "landingpageSnap.jpg",
        "url": "https://safe-cliffs-01394.herokuapp.com/"
      },
      {
        "title": "Trivia Game",
        "category": "A quiz game based on the Trivia",
        "image": "Trivia_Game.png",
        "url": "https://tranquil-woodland-23988.herokuapp.com/"
      }
    ]
  }
}
